report/sysbench/TiDB_test/oltp_update_non_index.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 15732.52 qps: 15732.52 (r/w/o: 0.00/15732.52/0.00) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 17452.15 qps: 17452.15 (r/w/o: 0.00/17452.15/0.00) lat (ms,99%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 17441.79 qps: 17441.79 (r/w/o: 0.00/17441.79/0.00) lat (ms,99%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 17831.85 qps: 17831.85 (r/w/o: 0.00/17831.85/0.00) lat (ms,99%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 17566.74 qps: 17566.74 (r/w/o: 0.00/17566.74/0.00) lat (ms,99%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 16923.57 qps: 16923.57 (r/w/o: 0.00/16923.57/0.00) lat (ms,99%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 16828.26 qps: 16828.26 (r/w/o: 0.00/16828.26/0.00) lat (ms,99%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 16747.49 qps: 16747.49 (r/w/o: 0.00/16747.49/0.00) lat (ms,99%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 17227.85 qps: 17227.85 (r/w/o: 0.00/17227.85/0.00) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 15708.68 qps: 15708.68 (r/w/o: 0.00/15708.68/0.00) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 16859.60 qps: 16859.60 (r/w/o: 0.00/16859.60/0.00) lat (ms,99%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 15529.32 qps: 15529.32 (r/w/o: 0.00/15529.32/0.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 15544.25 qps: 15544.25 (r/w/o: 0.00/15544.25/0.00) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 17100.34 qps: 17100.34 (r/w/o: 0.00/17100.34/0.00) lat (ms,99%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 16529.41 qps: 16529.41 (r/w/o: 0.00/16529.41/0.00) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 16427.41 qps: 16427.41 (r/w/o: 0.00/16427.41/0.00) lat (ms,99%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 16816.40 qps: 16816.40 (r/w/o: 0.00/16816.40/0.00) lat (ms,99%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 17267.91 qps: 17267.91 (r/w/o: 0.00/17267.91/0.00) lat (ms,99%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 17352.57 qps: 17352.57 (r/w/o: 0.00/17352.57/0.00) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 16670.57 qps: 16670.57 (r/w/o: 0.00/16670.57/0.00) lat (ms,99%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 17424.41 qps: 17424.41 (r/w/o: 0.00/17424.41/0.00) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 16911.73 qps: 16911.73 (r/w/o: 0.00/16911.73/0.00) lat (ms,99%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 16850.57 qps: 16850.57 (r/w/o: 0.00/16850.57/0.00) lat (ms,99%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 16197.02 qps: 16197.02 (r/w/o: 0.00/16197.02/0.00) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 200 tps: 16150.27 qps: 16150.27 (r/w/o: 0.00/16150.27/0.00) lat (ms,99%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 200 tps: 17400.61 qps: 17400.61 (r/w/o: 0.00/17400.61/0.00) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 200 tps: 17364.35 qps: 17364.35 (r/w/o: 0.00/17364.35/0.00) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 200 tps: 17339.18 qps: 17339.18 (r/w/o: 0.00/17339.18/0.00) lat (ms,99%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 200 tps: 17030.21 qps: 17030.21 (r/w/o: 0.00/17030.21/0.00) lat (ms,99%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 200 tps: 17196.42 qps: 17196.42 (r/w/o: 0.00/17196.42/0.00) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 200 tps: 17166.79 qps: 17166.79 (r/w/o: 0.00/17166.79/0.00) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 200 tps: 17098.61 qps: 17098.61 (r/w/o: 0.00/17098.61/0.00) lat (ms,99%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 200 tps: 16961.72 qps: 16961.72 (r/w/o: 0.00/16961.72/0.00) lat (ms,99%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 200 tps: 17120.78 qps: 17120.78 (r/w/o: 0.00/17120.78/0.00) lat (ms,99%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 200 tps: 17352.74 qps: 17352.74 (r/w/o: 0.00/17352.74/0.00) lat (ms,99%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 200 tps: 16141.67 qps: 16141.67 (r/w/o: 0.00/16141.67/0.00) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 200 tps: 15337.02 qps: 15337.02 (r/w/o: 0.00/15337.02/0.00) lat (ms,99%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 200 tps: 17345.90 qps: 17345.90 (r/w/o: 0.00/17345.90/0.00) lat (ms,99%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 200 tps: 17250.47 qps: 17250.47 (r/w/o: 0.00/17250.47/0.00) lat (ms,99%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 200 tps: 17214.38 qps: 17214.38 (r/w/o: 0.00/17214.38/0.00) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 200 tps: 17167.79 qps: 17167.79 (r/w/o: 0.00/17167.79/0.00) lat (ms,99%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 200 tps: 16537.49 qps: 16537.49 (r/w/o: 0.00/16537.49/0.00) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 200 tps: 17152.78 qps: 17152.78 (r/w/o: 0.00/17152.78/0.00) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 200 tps: 17292.61 qps: 17292.61 (r/w/o: 0.00/17292.61/0.00) lat (ms,99%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 200 tps: 16762.02 qps: 16762.02 (r/w/o: 0.00/16762.02/0.00) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 200 tps: 16674.16 qps: 16674.16 (r/w/o: 0.00/16674.16/0.00) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 200 tps: 16317.75 qps: 16317.75 (r/w/o: 0.00/16317.75/0.00) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 200 tps: 15636.85 qps: 15636.85 (r/w/o: 0.00/15636.85/0.00) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 200 tps: 16488.19 qps: 16488.19 (r/w/o: 0.00/16488.19/0.00) lat (ms,99%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 200 tps: 16967.20 qps: 16967.20 (r/w/o: 0.00/16967.20/0.00) lat (ms,99%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 200 tps: 16946.63 qps: 16946.63 (r/w/o: 0.00/16946.63/0.00) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 200 tps: 16614.59 qps: 16614.59 (r/w/o: 0.00/16614.59/0.00) lat (ms,99%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 200 tps: 17039.12 qps: 17039.12 (r/w/o: 0.00/17039.12/0.00) lat (ms,99%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 200 tps: 16917.52 qps: 16917.52 (r/w/o: 0.00/16917.52/0.00) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 200 tps: 17270.69 qps: 17270.69 (r/w/o: 0.00/17270.69/0.00) lat (ms,99%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 200 tps: 16813.61 qps: 16813.61 (r/w/o: 0.00/16813.61/0.00) lat (ms,99%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 200 tps: 17222.03 qps: 17222.03 (r/w/o: 0.00/17222.03/0.00) lat (ms,99%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 200 tps: 15972.25 qps: 15972.25 (r/w/o: 0.00/15972.25/0.00) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 200 tps: 17293.68 qps: 17293.68 (r/w/o: 0.00/17293.68/0.00) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 200 tps: 15714.60 qps: 15714.60 (r/w/o: 0.00/15714.60/0.00) lat (ms,99%): 29.72 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           5046303
        other:                           0
        total:                           5046303
    transactions:                        5046303 (16819.05 per sec.)
    queries:                             5046303 (16819.05 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0336s
    total number of events:              5046303

Latency (ms):
         min:                                    3.54
         avg:                                   11.89
         max:                                  290.09
         99th percentile:                       27.17
         sum:                             59999553.45

Threads fairness:
    events (avg/stddev):           25231.5150/53.52
    execution time (avg/stddev):   299.9978/0.01